In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns 

import warnings
warnings.filterwarnings("ignore")

 - Loading csv file into dataframe

In [35]:
df = pd.read_csv("raw_data.csv")

In [23]:
df.tail()

,id,gender,dob,income,marital_status,city,last_purchase_date,score
2564675,278d8e62-e08f-4ddc-9a2c-c1acafbff89c,Male,1975-04-26,20621,Widowed,Portland,2011-02-18,959
2564676,8d8591b5-f4d4-4a8d-b189-e6bde52ca3f4,Male,23-01-1983,13712,Married,Baltimore,2017-09-28,692
2564677,d026ad35-f992-43ca-918a-a760e43615be,Male,28-01-1976,62958,Widowed,Nashville,06-12-2015,471
2564678,a03048e4-ec77-4eca-8de2-2a6450e3c451,Female,1979-10-01,1082,Divorced,Milwaukee,2015-03-28,65
2564679,d189825b-aaff-47aa-9b75-826682a68828,Female,14-01-1988,48298,Widowed,Oklahoma City,2017-08-13,820

- Checking Rows and columns

In [37]:
df.shape

(2564680, 8)

- Checking Unique values

In [5]:
dict = {}
for i in list(df.columns):
    dict[i] = df[i].value_counts().shape[0]

#dict
pd.DataFrame(dict,index=["unique count"]).transpose()

                    unique count
id                        100000
gender                         2
dob                        20674
income                     62975
marital_status                 4
city                          49
last_purchase_date          8736
score                       1000

- Checking Null Values

In [6]:
df.isnull().sum()

id                         0
gender                234849
dob                        0
income                     0
marital_status        285195
city                   51187
last_purchase_date         0
score                      0
dtype: int64

- Handling Duplicate values

In [38]:
dup = df[df.duplicated()]
dup

,id,gender,dob,income,marital_status,city,last_purchase_date,score
30,72607e18-1ad5-4938-b4d8-815283bdde86,Male,1997-01-24,23242,Single,Memphis,07-02-2017,202
256,619a8262-03fe-47cc-8a66-401400833c07,NaN,07-03-1990,25347,NaN,Colorado Springs,13-06-2010,304
395,5ebd754b-dabc-462d-a367-b7e6e89c1c5a,Female,2000-03-02,93518,Widowed,New York,08-04-2019,477
546,862ac52a-a593-4ee0-8209-f752c6d9d852,Female,1998-11-06,15211,Married,Phoenix,13-08-2013,29
625,32f9b5c1-86fc-4ac2-9441-67428d312d74,Female,14-04-1977,85078,Single,NaN,17-05-2015,172
...,...,...,...,...,...,...,...,...
2564675,278d8e62-e08f-4ddc-9a2c-c1acafbff89c,Male,1975-04-26,20621,Widowed,Portland,2011-02-18,959
2564676,8d8591b5-f4d4-4a8d-b189-e6bde52ca3f4,Male,23-01-1983,13712,Married,Baltimore,2017-09-28,692
2564677,d026ad35-f992-43ca-918a-a760e43615be,Male,28-01-1976,62958,Widowed,Nashville,06-12-2015,471
2564678,a03048e4-ec77-4eca-8de2-2a6450e3c451,Female,1979-10-01,1082,Divorced,Milwaukee,2015-03-28,65
2564679,d189825b-aaff-47aa-9b75-826682a68828,Female,14-01-1988,48298,Widowed,Oklahoma City,2017-08-13,820

In [39]:
#Total Duplicate values
df.duplicated().count()

2564680

In [40]:
df.drop_duplicates(inplace=True)

In [41]:
df.shape

(100000, 8)

- Handling Null values with the mean of the respective columns.

In [66]:
data = df.copy()
data.head()

,id,gender,dob,income,marital_status,city,last_purchase_date,score
0,660ba2ad-e4ba-4e56-bc36-8a2daa77dd23,Male,1977-05-19,46532,Single,Oklahoma City,2020-06-22,63
1,6da25e92-ad6a-458b-a9b9-0995e664d229,Female,2000-11-28,13734,Single,Columbus,08-04-2020,43
2,11261389-dce2-4912-bd48-e406288f2a8b,Female,1975-06-05,36282,Single,Miami,2022-08-21,882
3,c9f67b5a-fcbf-4da0-bf31-c8d2492013ca,Male,27-05-1992,83451,Divorced,Colorado Springs,18-12-2020,653
4,d3024d83-cbd1-481a-8e29-a37259107dfb,Female,1987-09-13,58351,NaN,New Orleans,2021-05-25,535

In [67]:
#Filling NaN values with the mode of the respective columns
data['gender'].fillna(data['gender'].mode()[0], inplace=True)
data['marital_status'].fillna(data['marital_status'].mode()[0], inplace=True)
data['city'].fillna(data['city'].mode()[0], inplace=True)

In [45]:
data.isnull().sum()

id                    0
gender                0
dob                   0
income                0
marital_status        0
city                  0
last_purchase_date    0
score                 0
dtype: int64

Seeing no null values giving me Inner peace -_-

- Fixing Dob into dd-mm-yyy format

In [68]:
# bringing in yyyy-mm-dd
data['dob'] = pd.to_datetime(data.dob, errors='coerce')
# Then in dd-mm-yyyy
#data['dob'] = data['dob'].dt.strftime('%d-%m-%Y')

In [69]:
data.head(10)

,id,gender,dob,income,marital_status,city,last_purchase_date,score
0,660ba2ad-e4ba-4e56-bc36-8a2daa77dd23,Male,1977-05-19,46532,Single,Oklahoma City,2020-06-22,63
1,6da25e92-ad6a-458b-a9b9-0995e664d229,Female,2000-11-28,13734,Single,Columbus,08-04-2020,43
2,11261389-dce2-4912-bd48-e406288f2a8b,Female,1975-06-05,36282,Single,Miami,2022-08-21,882
3,c9f67b5a-fcbf-4da0-bf31-c8d2492013ca,Male,1992-05-27,83451,Divorced,Colorado Springs,18-12-2020,653
4,d3024d83-cbd1-481a-8e29-a37259107dfb,Female,1987-09-13,58351,Divorced,New Orleans,2021-05-25,535
5,748a9099-0ff1-46c1-b87b-574ea150aed9,Female,1990-08-18,47585,Married,Las Vegas,2018-04-17,639
6,a2c8d5b7-1ec2-49a9-88ee-07a9edd936ef,Female,1980-02-02,59336,Married,Kansas City,05-06-2010,974
7,add68c67-6249-432f-a382-8f8f961939cf,Female,1987-06-22,97629,Single,New Orleans,08-12-2018,162
8,ae4aba25-bc9e-4d31-9cea-f21406efd7a1,Male,1998-06-11,81892,Widowed,Houston,05-08-2011,472
9,a4739371-a97a-4436-a8c0-8365c4c7b148,Male,1999-04-18,15196,Divorced,San Antonio,2015-01-17,447

In [70]:
# Now need to calculate age 

now = pd.to_datetime('now')
data['age'] = (now.year - data['dob'].dt.year) - ((now.month - data['dob'].dt.month) < 0)

In [72]:
data.head()

,id,gender,dob,income,marital_status,city,last_purchase_date,score,age
0,660ba2ad-e4ba-4e56-bc36-8a2daa77dd23,Male,1977-05-19,46532,Single,Oklahoma City,2020-06-22,63,45
1,6da25e92-ad6a-458b-a9b9-0995e664d229,Female,2000-11-28,13734,Single,Columbus,08-04-2020,43,22
2,11261389-dce2-4912-bd48-e406288f2a8b,Female,1975-06-05,36282,Single,Miami,2022-08-21,882,47
3,c9f67b5a-fcbf-4da0-bf31-c8d2492013ca,Male,1992-05-27,83451,Divorced,Colorado Springs,18-12-2020,653,30
4,d3024d83-cbd1-481a-8e29-a37259107dfb,Female,1987-09-13,58351,Divorced,New Orleans,2021-05-25,535,35

In [74]:
p=data['income'].quantile(0.33)
q=data['income'].quantile(0.66)
r=data['income'].quantile(0.99)
print(p)
print(q)
print(r)

33916.34
66564.0
99020.0

In [ ]:
data['income'] < p
data['income'] >= p & data['income'] < q
data['income'] > q

In [ ]:
for i in data.index:
    if data['income'][i] < p:
        data['income_group'][i] = 'Low'
    elif data['income'][i] >= p and data['income'][i] < q:
        data['income_group'][i] = 'Medium'
    else:
        data['income_group'][i] = 'High'

In [84]:
income_group = []
for i in data['income'].index:
    if data['income'][i] < p:
        income_group.append("Low")
    elif data['income'][i] >= p and data['income'][i] < q:
        income_group.append("Medium")
    else:
        income_group.append("High")

In [93]:
income_df = pd.DataFrame(income_group, columns=['income_group'])
income_df.head()

  income_group
0       Medium
1          Low
2       Medium
3         High
4       Medium

In [96]:
data = data.assign(income_group=income_df["income_group"])
data.head(15)

,id,gender,dob,income,marital_status,city,last_purchase_date,score,age,income_group
0,660ba2ad-e4ba-4e56-bc36-8a2daa77dd23,Male,1977-05-19,46532,Single,Oklahoma City,2020-06-22,63,45,Medium
1,6da25e92-ad6a-458b-a9b9-0995e664d229,Female,2000-11-28,13734,Single,Columbus,08-04-2020,43,22,Low
2,11261389-dce2-4912-bd48-e406288f2a8b,Female,1975-06-05,36282,Single,Miami,2022-08-21,882,47,Medium
3,c9f67b5a-fcbf-4da0-bf31-c8d2492013ca,Male,1992-05-27,83451,Divorced,Colorado Springs,18-12-2020,653,30,High
4,d3024d83-cbd1-481a-8e29-a37259107dfb,Female,1987-09-13,58351,Divorced,New Orleans,2021-05-25,535,35,Medium
5,748a9099-0ff1-46c1-b87b-574ea150aed9,Female,1990-08-18,47585,Married,Las Vegas,2018-04-17,639,32,Medium
6,a2c8d5b7-1ec2-49a9-88ee-07a9edd936ef,Female,1980-02-02,59336,Married,Kansas City,05-06-2010,974,43,Medium
7,add68c67-6249-432f-a382-8f8f961939cf,Female,1987-06-22,97629,Single,New Orleans,08-12-2018,162,35,High
8,ae4aba25-bc9e-4d31-9cea-f21406efd7a1,Male,1998-06-11,81892,Widowed,Houston,05-08-2011,472,24,High
9,a4739371-a97a-4436-a8c0-8365c4c7b148,Male,1999-04-18,15196,Divorced,San Antonio,2015-01-17,447,23,Low
10,bafbbfc4-0758-4fe9-91bb-7812f2aeafc9,Male,1984-01-14,80519,Married,Phoenix,2015-03-20,843,39,High
11,8920429a-ab26-4a51-b6d9-a2c46736cd0c,Female,1972-07-24,62060,Divorced,Atlanta,2019-04-23,238,50,Medium
12,adfd5f38-a3f4-457b-ae23-f1efad8f9a70,Male,1996-07-04,74009,Divorced,Colorado Springs,18-06-2010,278,26,High
13,0afff259-aeb1-45be-8999-76ebf486a852,Male,1982-11-17,92235,Divorced,Philadelphia,21-08-2011,1,40,High
14,5cb99349-c183-4f3b-a471-5da8cb96096d,Female,2000-01-08,91309,Divorced,Mesa,20-05-2016,248,23,High